zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_core_hw.h
/***************************************************************************//**
* \file cy_crypto_core_hw.h
* \version 2.150.1
*
* \brief
*  This file provides the headers to the API for the utils
*  in the Crypto driver.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


#if !defined (CY_CRYPTO_CORE_HW_H)
#define CY_CRYPTO_CORE_HW_H

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTO)

#include "cy_crypto_common.h"

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 20.5', 1, \
'Since CY_CRYPTO_V1 is decided by PDL device agnostic / hardware specific model, use of #undef will not make it ambiguous that which macros exist at a particular point within a translation unit.')

#if (CY_IP_MXCRYPTO_VERSION == 1u)
#include "ip/cyip_crypto.h"
#endif

#if (CY_IP_MXCRYPTO_VERSION == 2u)
#if defined (CY_DEVICE_CAT1D)
#include "ip/cyip_crypto_v2_1.h"
#else
#include "ip/cyip_crypto_v2.h"
#endif

/* CRYPTO.CTL */
#if !defined(CRYPTO_CTL_ENABLED_Pos)
#define CRYPTO_CTL_ENABLED_Pos                  CRYPTO_V2_CTL_ENABLED_Pos
#endif
#if !defined(CRYPTO_CTL_ENABLED_Msk)
#define CRYPTO_CTL_ENABLED_Msk                  CRYPTO_V2_CTL_ENABLED_Msk
#endif

/* CRYPTO.STATUS */
#if !defined(CRYPTO_STATUS_VU_BUSY_Pos)
#define CRYPTO_STATUS_VU_BUSY_Pos               7UL
#endif
#if !defined(CRYPTO_STATUS_VU_BUSY_Msk)
#define CRYPTO_STATUS_VU_BUSY_Msk               0x80UL
#endif

/* CRYPTO.ERROR_STATUS1 */
#if !defined(CRYPTO_ERROR_STATUS1_DATA23_Pos)
#define CRYPTO_ERROR_STATUS1_DATA23_Pos         0UL
#endif
#if !defined(CRYPTO_ERROR_STATUS1_DATA23_Msk)
#define CRYPTO_ERROR_STATUS1_DATA23_Msk         0xFFFFFFUL
#endif
#if !defined(CRYPTO_ERROR_STATUS1_IDX_Pos)
#define CRYPTO_ERROR_STATUS1_IDX_Pos            CRYPTO_V2_ERROR_STATUS1_IDX_Pos
#endif
#if !defined(CRYPTO_ERROR_STATUS1_IDX_Msk)
#define CRYPTO_ERROR_STATUS1_IDX_Msk            CRYPTO_V2_ERROR_STATUS1_IDX_Msk
#endif
#if !defined(CRYPTO_ERROR_STATUS1_VALID_Pos)
#define CRYPTO_ERROR_STATUS1_VALID_Pos          CRYPTO_V2_ERROR_STATUS1_VALID_Pos
#endif
#if !defined(CRYPTO_ERROR_STATUS1_VALID_Msk)
#define CRYPTO_ERROR_STATUS1_VALID_Msk          CRYPTO_V2_ERROR_STATUS1_VALID_Msk
#endif

/* CRYPTO.INSTR_FF_STATUS */
#if !defined(CRYPTO_INSTR_FF_STATUS_USED_Pos)
#define CRYPTO_INSTR_FF_STATUS_USED_Pos         CRYPTO_V2_INSTR_FF_STATUS_USED_Pos
#endif
#if !defined(CRYPTO_INSTR_FF_STATUS_USED_Msk)
#define CRYPTO_INSTR_FF_STATUS_USED_Msk         CRYPTO_V2_INSTR_FF_STATUS_USED_Msk
#endif
#if !defined(CRYPTO_INSTR_FF_STATUS_EVENT_Pos)
#define CRYPTO_INSTR_FF_STATUS_EVENT_Pos        CRYPTO_V2_INSTR_FF_STATUS_EVENT_Pos
#endif
#if !defined(CRYPTO_INSTR_FF_STATUS_EVENT_Msk)
#define CRYPTO_INSTR_FF_STATUS_EVENT_Msk        CRYPTO_V2_INSTR_FF_STATUS_EVENT_Msk
#endif
#if !defined(CRYPTO_INSTR_FF_STATUS_BUSY_Pos)
#define CRYPTO_INSTR_FF_STATUS_BUSY_Pos         CRYPTO_V2_LOAD0_FF_STATUS_BUSY_Pos
#endif
#if !defined(CRYPTO_INSTR_FF_STATUS_BUSY_Msk)
#define CRYPTO_INSTR_FF_STATUS_BUSY_Msk         CRYPTO_V2_LOAD0_FF_STATUS_BUSY_Msk
#endif

/* CRYPTO.INSTR_FF_WR */
#if !defined(CRYPTO_INSTR_FF_WR_DATA32_Pos)
#define CRYPTO_INSTR_FF_WR_DATA32_Pos           CRYPTO_V2_INSTR_FF_WR_DATA32_Pos
#endif
#if !defined(CRYPTO_INSTR_FF_WR_DATA32_Msk)
#define CRYPTO_INSTR_FF_WR_DATA32_Msk           CRYPTO_V2_INSTR_FF_WR_DATA32_Msk
#endif

/* CRYPTO.RF_DATA */
#if !defined(CRYPTO_RF_DATA_DATA32_Pos)
#define CRYPTO_RF_DATA_DATA32_Pos               CRYPTO_V2_VU_RF_DATA_DATA32_Pos
#endif
#if !defined(CRYPTO_RF_DATA_DATA32_Msk)
#define CRYPTO_RF_DATA_DATA32_Msk               CRYPTO_V2_VU_RF_DATA_DATA32_Msk
#endif

/* CRYPTO.AES_CTL */
#if !defined(CRYPTO_AES_CTL_KEY_SIZE_Pos)
#define CRYPTO_AES_CTL_KEY_SIZE_Pos             CRYPTO_V2_AES_CTL_KEY_SIZE_Pos
#endif
#if !defined(CRYPTO_AES_CTL_KEY_SIZE_Msk)
#define CRYPTO_AES_CTL_KEY_SIZE_Msk             CRYPTO_V2_AES_CTL_KEY_SIZE_Msk
#endif

/* CRYPTO.PR_LFSR_CTL0 */
#if !defined(CRYPTO_PR_LFSR_CTL0_LFSR32_Pos)
#define CRYPTO_PR_LFSR_CTL0_LFSR32_Pos          CRYPTO_V2_PR_LFSR_CTL0_LFSR32_Pos
#endif
#if !defined(CRYPTO_PR_LFSR_CTL0_LFSR32_Msk)
#define CRYPTO_PR_LFSR_CTL0_LFSR32_Msk          CRYPTO_V2_PR_LFSR_CTL0_LFSR32_Msk
#endif

/* CRYPTO.PR_LFSR_CTL1 */
#if !defined(CRYPTO_PR_LFSR_CTL1_LFSR31_Pos)
#define CRYPTO_PR_LFSR_CTL1_LFSR31_Pos          CRYPTO_V2_PR_LFSR_CTL1_LFSR31_Pos
#endif
#if !defined(CRYPTO_PR_LFSR_CTL1_LFSR31_Msk)
#define CRYPTO_PR_LFSR_CTL1_LFSR31_Msk          CRYPTO_V2_PR_LFSR_CTL1_LFSR31_Msk
#endif

/* CRYPTO.PR_LFSR_CTL2 */
#if !defined(CRYPTO_PR_LFSR_CTL2_LFSR29_Pos)
#define CRYPTO_PR_LFSR_CTL2_LFSR29_Pos          CRYPTO_V2_PR_LFSR_CTL2_LFSR29_Pos
#endif
#if !defined(CRYPTO_PR_LFSR_CTL2_LFSR29_Msk)
#define CRYPTO_PR_LFSR_CTL2_LFSR29_Msk          CRYPTO_V2_PR_LFSR_CTL2_LFSR29_Msk
#endif

/* CRYPTO.TR_CTL0 */
#if !defined(CRYPTO_TR_CTL0_SAMPLE_CLOCK_DIV_Pos)
#define CRYPTO_TR_CTL0_SAMPLE_CLOCK_DIV_Pos     CRYPTO_V2_TR_CTL0_SAMPLE_CLOCK_DIV_Pos
#endif
#if !defined(CRYPTO_TR_CTL0_SAMPLE_CLOCK_DIV_Msk)
#define CRYPTO_TR_CTL0_SAMPLE_CLOCK_DIV_Msk     CRYPTO_V2_TR_CTL0_SAMPLE_CLOCK_DIV_Msk
#endif
#if !defined(CRYPTO_TR_CTL0_RED_CLOCK_DIV_Pos)
#define CRYPTO_TR_CTL0_RED_CLOCK_DIV_Pos        CRYPTO_V2_TR_CTL0_RED_CLOCK_DIV_Pos
#endif
#if !defined(CRYPTO_TR_CTL0_RED_CLOCK_DIV_Msk)
#define CRYPTO_TR_CTL0_RED_CLOCK_DIV_Msk        CRYPTO_V2_TR_CTL0_RED_CLOCK_DIV_Msk
#endif
#if !defined(CRYPTO_TR_CTL0_INIT_DELAY_Pos)
#define CRYPTO_TR_CTL0_INIT_DELAY_Pos           CRYPTO_V2_TR_CTL0_INIT_DELAY_Pos
#endif
#if !defined(CRYPTO_TR_CTL0_INIT_DELAY_Msk)
#define CRYPTO_TR_CTL0_INIT_DELAY_Msk           CRYPTO_V2_TR_CTL0_INIT_DELAY_Msk
#endif
#if !defined(CRYPTO_TR_CTL0_VON_NEUMANN_CORR_Pos)
#define CRYPTO_TR_CTL0_VON_NEUMANN_CORR_Pos     CRYPTO_V2_TR_CTL0_VON_NEUMANN_CORR_Pos
#endif
#if !defined(CRYPTO_TR_CTL0_VON_NEUMANN_CORR_Msk)
#define CRYPTO_TR_CTL0_VON_NEUMANN_CORR_Msk     CRYPTO_V2_TR_CTL0_VON_NEUMANN_CORR_Msk
#endif
#if !defined(CRYPTO_TR_CTL0_STOP_ON_AP_DETECT_Pos)
#define CRYPTO_TR_CTL0_STOP_ON_AP_DETECT_Pos    CRYPTO_V2_TR_CTL0_STOP_ON_AP_DETECT_Pos
#endif
#if !defined(CRYPTO_TR_CTL0_STOP_ON_AP_DETECT_Msk)
#define CRYPTO_TR_CTL0_STOP_ON_AP_DETECT_Msk    CRYPTO_V2_TR_CTL0_STOP_ON_AP_DETECT_Msk
#endif
#if !defined(CRYPTO_TR_CTL0_STOP_ON_RC_DETECT_Pos)
#define CRYPTO_TR_CTL0_STOP_ON_RC_DETECT_Pos    CRYPTO_V2_TR_CTL0_STOP_ON_RC_DETECT_Pos
#endif
#if !defined(CRYPTO_TR_CTL0_STOP_ON_RC_DETECT_Msk)
#define CRYPTO_TR_CTL0_STOP_ON_RC_DETECT_Msk    CRYPTO_V2_TR_CTL0_STOP_ON_RC_DETECT_Msk
#endif

/* CRYPTO.TR_CTL1 */
#if !defined(CRYPTO_TR_CTL1_RO11_EN_Pos)
#define CRYPTO_TR_CTL1_RO11_EN_Pos              CRYPTO_V2_TR_CTL1_RO11_EN_Pos
#endif
#if !defined(CRYPTO_TR_CTL1_RO11_EN_Msk)
#define CRYPTO_TR_CTL1_RO11_EN_Msk              CRYPTO_V2_TR_CTL1_RO11_EN_Msk
#endif
#if !defined(CRYPTO_TR_CTL1_RO15_EN_Pos)
#define CRYPTO_TR_CTL1_RO15_EN_Pos              CRYPTO_V2_TR_CTL1_RO15_EN_Pos
#endif
#if !defined(CRYPTO_TR_CTL1_RO15_EN_Msk)
#define CRYPTO_TR_CTL1_RO15_EN_Msk              CRYPTO_V2_TR_CTL1_RO15_EN_Msk
#endif
#if !defined(CRYPTO_TR_CTL1_GARO15_EN_Pos)
#define CRYPTO_TR_CTL1_GARO15_EN_Pos            CRYPTO_V2_TR_CTL1_GARO15_EN_Pos
#endif
#if !defined(CRYPTO_TR_CTL1_GARO15_EN_Msk)
#define CRYPTO_TR_CTL1_GARO15_EN_Msk            CRYPTO_V2_TR_CTL1_GARO15_EN_Msk
#endif
#if !defined(CRYPTO_TR_CTL1_GARO31_EN_Pos)
#define CRYPTO_TR_CTL1_GARO31_EN_Pos            CRYPTO_V2_TR_CTL1_GARO31_EN_Pos
#endif
#if !defined(CRYPTO_TR_CTL1_GARO31_EN_Msk)
#define CRYPTO_TR_CTL1_GARO31_EN_Msk            CRYPTO_V2_TR_CTL1_GARO31_EN_Msk
#endif
#if !defined(CRYPTO_TR_CTL1_FIRO15_EN_Pos)
#define CRYPTO_TR_CTL1_FIRO15_EN_Pos            CRYPTO_V2_TR_CTL1_FIRO15_EN_Pos
#endif
#if !defined(CRYPTO_TR_CTL1_FIRO15_EN_Msk)
#define CRYPTO_TR_CTL1_FIRO15_EN_Msk            CRYPTO_V2_TR_CTL1_FIRO15_EN_Msk
#endif
#if !defined(CRYPTO_TR_CTL1_FIRO31_EN_Pos)
#define CRYPTO_TR_CTL1_FIRO31_EN_Pos            CRYPTO_V2_TR_CTL1_FIRO31_EN_Pos
#endif
#if !defined(CRYPTO_TR_CTL1_FIRO31_EN_Msk)
#define CRYPTO_TR_CTL1_FIRO31_EN_Msk            CRYPTO_V2_TR_CTL1_FIRO31_EN_Msk
#endif

/* CRYPTO.TR_RESULT */
#if !defined(CRYPTO_TR_RESULT_DATA32_Pos)
#define CRYPTO_TR_RESULT_DATA32_Pos             CRYPTO_V2_TR_RESULT_DATA32_Pos
#endif
#if !defined(CRYPTO_TR_RESULT_DATA32_Msk)
#define CRYPTO_TR_RESULT_DATA32_Msk             CRYPTO_V2_TR_RESULT_DATA32_Msk
#endif

/* CRYPTO.TR_GARO_CTL */
#if !defined(CRYPTO_TR_GARO_CTL_POLYNOMIAL31_Pos)
#define CRYPTO_TR_GARO_CTL_POLYNOMIAL31_Pos     CRYPTO_V2_TR_GARO_CTL_POLYNOMIAL31_Pos
#endif
#if !defined(CRYPTO_TR_GARO_CTL_POLYNOMIAL31_Msk)
#define CRYPTO_TR_GARO_CTL_POLYNOMIAL31_Msk     CRYPTO_V2_TR_GARO_CTL_POLYNOMIAL31_Msk
#endif

/* CRYPTO.TR_FIRO_CTL */
#if !defined(CRYPTO_TR_FIRO_CTL_POLYNOMIAL31_Pos)
#define CRYPTO_TR_FIRO_CTL_POLYNOMIAL31_Pos     CRYPTO_V2_TR_FIRO_CTL_POLYNOMIAL31_Pos
#endif
#if !defined(CRYPTO_TR_FIRO_CTL_POLYNOMIAL31_Msk)
#define CRYPTO_TR_FIRO_CTL_POLYNOMIAL31_Msk     CRYPTO_V2_TR_FIRO_CTL_POLYNOMIAL31_Msk
#endif

/* CRYPTO.TR_MON_CTL */
#if !defined(CRYPTO_TR_MON_CTL_BITSTREAM_SEL_Pos)
#define CRYPTO_TR_MON_CTL_BITSTREAM_SEL_Pos     CRYPTO_V2_TR_MON_CTL_BITSTREAM_SEL_Pos
#endif
#if !defined(CRYPTO_TR_MON_CTL_BITSTREAM_SEL_Msk)
#define CRYPTO_TR_MON_CTL_BITSTREAM_SEL_Msk     CRYPTO_V2_TR_MON_CTL_BITSTREAM_SEL_Msk
#endif

/* CRYPTO.TR_MON_CMD */
#if !defined(CRYPTO_TR_MON_CMD_START_AP_Pos)
#define CRYPTO_TR_MON_CMD_START_AP_Pos          CRYPTO_V2_TR_MON_CMD_START_AP_Pos
#endif
#if !defined(CRYPTO_TR_MON_CMD_START_AP_Msk)
#define CRYPTO_TR_MON_CMD_START_AP_Msk          CRYPTO_V2_TR_MON_CMD_START_AP_Msk
#endif
#if !defined(CRYPTO_TR_MON_CMD_START_RC_Pos)
#define CRYPTO_TR_MON_CMD_START_RC_Pos          CRYPTO_V2_TR_MON_CMD_START_RC_Pos
#endif
#if !defined(CRYPTO_TR_MON_CMD_START_RC_Msk)
#define CRYPTO_TR_MON_CMD_START_RC_Msk          CRYPTO_V2_TR_MON_CMD_START_RC_Msk
#endif

/* CRYPTO.TR_MON_RC_CTL */
#if !defined(CRYPTO_TR_MON_RC_CTL_CUTOFF_COUNT8_Pos)
#define CRYPTO_TR_MON_RC_CTL_CUTOFF_COUNT8_Pos  CRYPTO_V2_TR_MON_RC_CTL_CUTOFF_COUNT8_Pos
#endif
#if !defined(CRYPTO_TR_MON_RC_CTL_CUTOFF_COUNT8_Msk)
#define CRYPTO_TR_MON_RC_CTL_CUTOFF_COUNT8_Msk  CRYPTO_V2_TR_MON_RC_CTL_CUTOFF_COUNT8_Msk
#endif

