zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_core_hw.h
/* CRYPTO.TR_MON_RC_STATUS0 */
#if !defined(CRYPTO_TR_MON_RC_STATUS0_BIT_Pos)
#define CRYPTO_TR_MON_RC_STATUS0_BIT_Pos        CRYPTO_V2_TR_MON_RC_STATUS0_BIT_Pos
#endif
#if !defined(CRYPTO_TR_MON_RC_STATUS0_BIT_Msk)
#define CRYPTO_TR_MON_RC_STATUS0_BIT_Msk        CRYPTO_V2_TR_MON_RC_STATUS0_BIT_Msk
#endif

/* CRYPTO.TR_MON_RC_STATUS1 */
#if !defined(CRYPTO_TR_MON_RC_STATUS1_REP_COUNT_Pos)
#define CRYPTO_TR_MON_RC_STATUS1_REP_COUNT_Pos  CRYPTO_V2_TR_MON_RC_STATUS1_REP_COUNT_Pos
#endif
#if !defined(CRYPTO_TR_MON_RC_STATUS1_REP_COUNT_Msk)
#define CRYPTO_TR_MON_RC_STATUS1_REP_COUNT_Msk  CRYPTO_V2_TR_MON_RC_STATUS1_REP_COUNT_Msk
#endif

/* CRYPTO.TR_MON_AP_CTL */
#if !defined(CRYPTO_TR_MON_AP_CTL_CUTOFF_COUNT16_Pos)
#define CRYPTO_TR_MON_AP_CTL_CUTOFF_COUNT16_Pos CRYPTO_V2_TR_MON_AP_CTL_CUTOFF_COUNT16_Pos
#endif
#if !defined(CRYPTO_TR_MON_AP_CTL_CUTOFF_COUNT16_Msk)
#define CRYPTO_TR_MON_AP_CTL_CUTOFF_COUNT16_Msk CRYPTO_V2_TR_MON_AP_CTL_CUTOFF_COUNT16_Msk
#endif
#if !defined(CRYPTO_TR_MON_AP_CTL_WINDOW_SIZE_Pos)
#define CRYPTO_TR_MON_AP_CTL_WINDOW_SIZE_Pos    CRYPTO_V2_TR_MON_AP_CTL_WINDOW_SIZE_Pos
#endif
#if !defined(CRYPTO_TR_MON_AP_CTL_WINDOW_SIZE_Msk)
#define CRYPTO_TR_MON_AP_CTL_WINDOW_SIZE_Msk    CRYPTO_V2_TR_MON_AP_CTL_WINDOW_SIZE_Msk
#endif

/* CRYPTO.TR_MON_AP_STATUS0 */
#if !defined(CRYPTO_TR_MON_AP_STATUS0_BIT_Pos)
#define CRYPTO_TR_MON_AP_STATUS0_BIT_Pos        CRYPTO_V2_TR_MON_AP_STATUS0_BIT_Pos
#endif
#if !defined(CRYPTO_TR_MON_AP_STATUS0_BIT_Msk)
#define CRYPTO_TR_MON_AP_STATUS0_BIT_Msk        CRYPTO_V2_TR_MON_AP_STATUS0_BIT_Msk
#endif

/* CRYPTO.TR_MON_AP_STATUS1 */
#if !defined(CRYPTO_TR_MON_AP_STATUS1_OCC_COUNT_Pos)
#define CRYPTO_TR_MON_AP_STATUS1_OCC_COUNT_Pos  CRYPTO_V2_TR_MON_AP_STATUS1_OCC_COUNT_Pos
#endif
#if !defined(CRYPTO_TR_MON_AP_STATUS1_OCC_COUNT_Msk)
#define CRYPTO_TR_MON_AP_STATUS1_OCC_COUNT_Msk  CRYPTO_V2_TR_MON_AP_STATUS1_OCC_COUNT_Msk
#endif
#if !defined(CRYPTO_TR_MON_AP_STATUS1_WINDOW_INDEX_Pos)
#define CRYPTO_TR_MON_AP_STATUS1_WINDOW_INDEX_Pos CRYPTO_V2_TR_MON_AP_STATUS1_WINDOW_INDEX_Pos
#endif
#if !defined(CRYPTO_TR_MON_AP_STATUS1_WINDOW_INDEX_Msk)
#define CRYPTO_TR_MON_AP_STATUS1_WINDOW_INDEX_Msk CRYPTO_V2_TR_MON_AP_STATUS1_WINDOW_INDEX_Msk
#endif

/* CRYPTO.VU_STATUS */
#if !defined(CRYPTO_VU_STATUS_CARRY_Pos)
#define CRYPTO_VU_STATUS_CARRY_Pos              CRYPTO_V2_VU_STATUS_CARRY_Pos
#endif
#if !defined(CRYPTO_VU_STATUS_CARRY_Msk)
#define CRYPTO_VU_STATUS_CARRY_Msk              CRYPTO_V2_VU_STATUS_CARRY_Msk
#endif
#if !defined(CRYPTO_VU_STATUS_EVEN_Pos)
#define CRYPTO_VU_STATUS_EVEN_Pos               CRYPTO_V2_VU_STATUS_EVEN_Pos
#endif
#if !defined(CRYPTO_VU_STATUS_EVEN_Msk)
#define CRYPTO_VU_STATUS_EVEN_Msk               CRYPTO_V2_VU_STATUS_EVEN_Msk
#endif
#if !defined(CRYPTO_VU_STATUS_ZERO_Pos)
#define CRYPTO_VU_STATUS_ZERO_Pos               CRYPTO_V2_VU_STATUS_ZERO_Pos
#endif
#if !defined(CRYPTO_VU_STATUS_ZERO_Msk)
#define CRYPTO_VU_STATUS_ZERO_Msk               CRYPTO_V2_VU_STATUS_ZERO_Msk
#endif
#if !defined(CRYPTO_VU_STATUS_ONE_Pos)
#define CRYPTO_VU_STATUS_ONE_Pos                CRYPTO_V2_VU_STATUS_ONE_Pos
#endif
#if !defined(CRYPTO_VU_STATUS_ONE_Msk)
#define CRYPTO_VU_STATUS_ONE_Msk                CRYPTO_V2_VU_STATUS_ONE_Msk
#endif

/* CRYPTO.INTR */
#if !defined(CRYPTO_INTR_TR_INITIALIZED_Pos)
#define CRYPTO_INTR_TR_INITIALIZED_Pos          CRYPTO_V2_INTR_TR_INITIALIZED_Pos
#endif
#if !defined(CRYPTO_INTR_TR_INITIALIZED_Msk)
#define CRYPTO_INTR_TR_INITIALIZED_Msk          CRYPTO_V2_INTR_TR_INITIALIZED_Msk
#endif
#if !defined(CRYPTO_INTR_TR_DATA_AVAILABLE_Pos)
#define CRYPTO_INTR_TR_DATA_AVAILABLE_Pos       CRYPTO_V2_INTR_TR_DATA_AVAILABLE_Pos
#endif
#if !defined(CRYPTO_INTR_TR_DATA_AVAILABLE_Msk)
#define CRYPTO_INTR_TR_DATA_AVAILABLE_Msk       CRYPTO_V2_INTR_TR_DATA_AVAILABLE_Msk
#endif
#if !defined(CRYPTO_INTR_INSTR_OPC_ERROR_Pos)
#define CRYPTO_INTR_INSTR_OPC_ERROR_Pos         CRYPTO_V2_INTR_INSTR_OPC_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_INSTR_OPC_ERROR_Msk)
#define CRYPTO_INTR_INSTR_OPC_ERROR_Msk         CRYPTO_V2_INTR_INSTR_OPC_ERROR_Msk
#endif
#if !defined(CRYPTO_INTR_INSTR_CC_ERROR_Pos)
#define CRYPTO_INTR_INSTR_CC_ERROR_Pos          CRYPTO_V2_INTR_INSTR_CC_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_INSTR_CC_ERROR_Msk)
#define CRYPTO_INTR_INSTR_CC_ERROR_Msk          CRYPTO_V2_INTR_INSTR_CC_ERROR_Msk
#endif
#if !defined(CRYPTO_INTR_BUS_ERROR_Pos)
#define CRYPTO_INTR_BUS_ERROR_Pos               CRYPTO_V2_INTR_BUS_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_BUS_ERROR_Msk)
#define CRYPTO_INTR_BUS_ERROR_Msk               CRYPTO_V2_INTR_BUS_ERROR_Msk
#endif
#if !defined(CRYPTO_INTR_TR_AP_DETECT_ERROR_Pos)
#define CRYPTO_INTR_TR_AP_DETECT_ERROR_Pos      CRYPTO_V2_INTR_TR_AP_DETECT_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_TR_AP_DETECT_ERROR_Msk)
#define CRYPTO_INTR_TR_AP_DETECT_ERROR_Msk      CRYPTO_V2_INTR_TR_AP_DETECT_ERROR_Msk
#endif
#if !defined(CRYPTO_INTR_TR_RC_DETECT_ERROR_Pos)
#define CRYPTO_INTR_TR_RC_DETECT_ERROR_Pos      CRYPTO_V2_INTR_TR_RC_DETECT_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_TR_RC_DETECT_ERROR_Msk)
#define CRYPTO_INTR_TR_RC_DETECT_ERROR_Msk      CRYPTO_V2_INTR_TR_RC_DETECT_ERROR_Msk
#endif

/* CRYPTO.INTR_MASK */
#if !defined(CRYPTO_INTR_MASK_INSTR_FF_LEVEL_Pos)
#define CRYPTO_INTR_MASK_INSTR_FF_LEVEL_Pos     CRYPTO_V2_INTR_MASK_INSTR_FF_LEVEL_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_INSTR_FF_LEVEL_Msk)
#define CRYPTO_INTR_MASK_INSTR_FF_LEVEL_Msk     CRYPTO_V2_INTR_MASK_INSTR_FF_LEVEL_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_INSTR_FF_OVERFLOW_Pos)
#define CRYPTO_INTR_MASK_INSTR_FF_OVERFLOW_Pos  CRYPTO_V2_INTR_MASK_INSTR_FF_OVERFLOW_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_INSTR_FF_OVERFLOW_Msk)
#define CRYPTO_INTR_MASK_INSTR_FF_OVERFLOW_Msk  CRYPTO_V2_INTR_MASK_INSTR_FF_OVERFLOW_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_TR_INITIALIZED_Pos)
#define CRYPTO_INTR_MASK_TR_INITIALIZED_Pos     CRYPTO_V2_INTR_MASK_TR_INITIALIZED_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_TR_INITIALIZED_Msk)
#define CRYPTO_INTR_MASK_TR_INITIALIZED_Msk     CRYPTO_V2_INTR_MASK_TR_INITIALIZED_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_TR_DATA_AVAILABLE_Pos)
#define CRYPTO_INTR_MASK_TR_DATA_AVAILABLE_Pos  CRYPTO_V2_INTR_MASK_TR_DATA_AVAILABLE_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_TR_DATA_AVAILABLE_Msk)
#define CRYPTO_INTR_MASK_TR_DATA_AVAILABLE_Msk  CRYPTO_V2_INTR_MASK_TR_DATA_AVAILABLE_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_PR_DATA_AVAILABLE_Pos)
#define CRYPTO_INTR_MASK_PR_DATA_AVAILABLE_Pos  CRYPTO_V2_INTR_MASK_PR_DATA_AVAILABLE_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_PR_DATA_AVAILABLE_Msk)
#define CRYPTO_INTR_MASK_PR_DATA_AVAILABLE_Msk  CRYPTO_V2_INTR_MASK_PR_DATA_AVAILABLE_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_INSTR_OPC_ERROR_Pos)
#define CRYPTO_INTR_MASK_INSTR_OPC_ERROR_Pos    CRYPTO_V2_INTR_MASK_INSTR_OPC_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_INSTR_OPC_ERROR_Msk)
#define CRYPTO_INTR_MASK_INSTR_OPC_ERROR_Msk    CRYPTO_V2_INTR_MASK_INSTR_OPC_ERROR_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_INSTR_CC_ERROR_Pos)
#define CRYPTO_INTR_MASK_INSTR_CC_ERROR_Pos     CRYPTO_V2_INTR_MASK_INSTR_CC_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_INSTR_CC_ERROR_Msk)
#define CRYPTO_INTR_MASK_INSTR_CC_ERROR_Msk     CRYPTO_V2_INTR_MASK_INSTR_CC_ERROR_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_BUS_ERROR_Pos)
#define CRYPTO_INTR_MASK_BUS_ERROR_Pos          CRYPTO_V2_INTR_MASK_BUS_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_BUS_ERROR_Msk)
#define CRYPTO_INTR_MASK_BUS_ERROR_Msk          CRYPTO_V2_INTR_MASK_BUS_ERROR_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_TR_AP_DETECT_ERROR_Pos)
#define CRYPTO_INTR_MASK_TR_AP_DETECT_ERROR_Pos CRYPTO_V2_INTR_MASK_TR_AP_DETECT_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_TR_AP_DETECT_ERROR_Msk)
#define CRYPTO_INTR_MASK_TR_AP_DETECT_ERROR_Msk CRYPTO_V2_INTR_MASK_TR_AP_DETECT_ERROR_Msk
#endif
#if !defined(CRYPTO_INTR_MASK_TR_RC_DETECT_ERROR_Pos)
#define CRYPTO_INTR_MASK_TR_RC_DETECT_ERROR_Pos CRYPTO_V2_INTR_MASK_TR_RC_DETECT_ERROR_Pos
#endif
#if !defined(CRYPTO_INTR_MASK_TR_RC_DETECT_ERROR_Msk)
#define CRYPTO_INTR_MASK_TR_RC_DETECT_ERROR_Msk CRYPTO_V2_INTR_MASK_TR_RC_DETECT_ERROR_Msk
#endif
#endif


/** \cond INTERNAL */

