zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_core_hw.h
/*******************************************************************************
*                CRYPTO
*******************************************************************************/
/* Non-changed registers */
#define REG_CRYPTO_CTL(base)               (((CRYPTO_Type*)(base))->CTL)
#define REG_CRYPTO_ERROR_STATUS0(base)     (((CRYPTO_Type*)(base))->ERROR_STATUS0)
#define REG_CRYPTO_ERROR_STATUS1(base)     (((CRYPTO_Type*)(base))->ERROR_STATUS1)
#define REG_CRYPTO_PR_LFSR_CTL0(base)      (((CRYPTO_Type*)(base))->PR_LFSR_CTL0)
#define REG_CRYPTO_PR_LFSR_CTL1(base)      (((CRYPTO_Type*)(base))->PR_LFSR_CTL1)
#define REG_CRYPTO_PR_LFSR_CTL2(base)      (((CRYPTO_Type*)(base))->PR_LFSR_CTL2)
#define REG_CRYPTO_TR_CTL0(base)           (((CRYPTO_Type*)(base))->TR_CTL0)
#define REG_CRYPTO_TR_CTL1(base)           (((CRYPTO_Type*)(base))->TR_CTL1)
#define REG_CRYPTO_TR_GARO_CTL(base)       (((CRYPTO_Type*)(base))->TR_GARO_CTL)
#define REG_CRYPTO_TR_FIRO_CTL(base)       (((CRYPTO_Type*)(base))->TR_FIRO_CTL)
#define REG_CRYPTO_TR_MON_CTL(base)        (((CRYPTO_Type*)(base))->TR_MON_CTL)
#define REG_CRYPTO_TR_MON_CMD(base)        (((CRYPTO_Type*)(base))->TR_MON_CMD)
#define REG_CRYPTO_TR_MON_RC_CTL(base)     (((CRYPTO_Type*)(base))->TR_MON_RC_CTL)
#define REG_CRYPTO_TR_MON_RC_STATUS0(base) (((CRYPTO_Type*)(base))->TR_MON_RC_STATUS0)
#define REG_CRYPTO_TR_MON_RC_STATUS1(base) (((CRYPTO_Type*)(base))->TR_MON_RC_STATUS1)
#define REG_CRYPTO_TR_MON_AP_CTL(base)     (((CRYPTO_Type*)(base))->TR_MON_AP_CTL)
#define REG_CRYPTO_TR_MON_AP_STATUS0(base) (((CRYPTO_Type*)(base))->TR_MON_AP_STATUS0)
#define REG_CRYPTO_TR_MON_AP_STATUS1(base) (((CRYPTO_Type*)(base))->TR_MON_AP_STATUS1)

/* Changed registers in the regmap */
#if !defined(CY_CRYPTO_CFG_HW_USE_MPN_SPECIFIC)

/* Use PDL device agnostic model */

#define REG_CRYPTO_STATUS(base)            (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoStatusOffset))
#define REG_CRYPTO_INSTR_FF_CTL(base)      (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoIstrFfCtlOffset))
#define REG_CRYPTO_INSTR_FF_STATUS(base)   (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoInstrFfStatusOffset))
#define REG_CRYPTO_INSTR_FF_WR(base)       (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoInstrFfWrOffset))
#define REG_CRYPTO_AES_CTL(base)           (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoAesCtlOffset))
#define REG_CRYPTO_PR_RESULT(base)         (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoPrResultOffset))
#define REG_CRYPTO_TR_RESULT(base)         (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoTrResultOffset))
#define REG_CRYPTO_CRC_CTL(base)           (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoCrcCtlOffset))
#define REG_CRYPTO_CRC_DATA_CTL(base)      (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoCrcDataCtlOffset))
#define REG_CRYPTO_CRC_POL_CTL(base)       (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoCrcPolCtlOffset))
#define REG_CRYPTO_CRC_REM_CTL(base)       (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoCrcRemCtlOffset))
#define REG_CRYPTO_CRC_REM_RESULT(base)    (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoCrcRemResultOffset))
#define REG_CRYPTO_VU_CTL0(base)           (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoVuCtl0Offset))
#define REG_CRYPTO_VU_CTL1(base)           (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoVuCtl1Offset))
#define REG_CRYPTO_VU_STATUS(base)         (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoVuStatusOffset))
#define REG_CRYPTO_INTR(base)              (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoIntrOffset))
#define REG_CRYPTO_INTR_SET(base)          (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoIntrSetOffset))
#define REG_CRYPTO_INTR_MASK(base)         (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoIntrMaskOffset))
#define REG_CRYPTO_INTR_MASKED(base)       (*(volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoIntrMaskedOffset))
#define REG_CRYPTO_VU_RF_DATA(base, reg)   ( (volatile uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoVuRfDataOffset))[(reg)]
#define REG_CRYPTO_MEM_BUFF(base)          ( (uint32_t*)((uint32_t)(base) + cy_cryptoIP->cryptoMemBufOffset))

#else

/* Use hardware specific model*/

#undef  CY_CRYPTO_V1
#define CY_CRYPTO_V1                       (1U == CY_IP_MXCRYPTO_VERSION) /* true if the mxcrypto version is 1 */

#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
#define REG_CRYPTO_STATUS(base)            (((CRYPTO_V1_Type*)(base))->STATUS)
#define REG_CRYPTO_INSTR_FF_CTL(base)      (((CRYPTO_V1_Type*)(base))->INSTR_FF_CTL)
#define REG_CRYPTO_INSTR_FF_STATUS(base)   (((CRYPTO_V1_Type*)(base))->INSTR_FF_STATUS)
#define REG_CRYPTO_INSTR_FF_WR(base)       (((CRYPTO_V1_Type*)(base))->INSTR_FF_WR)
#define REG_CRYPTO_AES_CTL(base)           (((CRYPTO_V1_Type*)(base))->AES_CTL)
#define REG_CRYPTO_PR_RESULT(base)         (((CRYPTO_V1_Type*)(base))->PR_RESULT)
#define REG_CRYPTO_TR_RESULT(base)         (((CRYPTO_V1_Type*)(base))->TR_RESULT)
#define REG_CRYPTO_CRC_CTL(base)           (((CRYPTO_V1_Type*)(base))->CRC_CTL)
#define REG_CRYPTO_CRC_DATA_CTL(base)      (((CRYPTO_V1_Type*)(base))->CRC_DATA_CTL)
#define REG_CRYPTO_CRC_POL_CTL(base)       (((CRYPTO_V1_Type*)(base))->CRC_POL_CTL)
#define REG_CRYPTO_CRC_REM_CTL(base)       (((CRYPTO_V1_Type*)(base))->CRC_REM_CTL)
#define REG_CRYPTO_CRC_REM_RESULT(base)    (((CRYPTO_V1_Type*)(base))->CRC_REM_RESULT)
#define REG_CRYPTO_VU_CTL0(base)           (((CRYPTO_V1_Type*)(base))->VU_CTL0)
#define REG_CRYPTO_VU_CTL1(base)           (((CRYPTO_V1_Type*)(base))->VU_CTL1)
#define REG_CRYPTO_VU_STATUS(base)         (((CRYPTO_V1_Type*)(base))->VU_STATUS)
#define REG_CRYPTO_INTR(base)              (((CRYPTO_V1_Type*)(base))->INTR)
#define REG_CRYPTO_INTR_SET(base)          (((CRYPTO_V1_Type*)(base))->INTR_SET)
#define REG_CRYPTO_INTR_MASK(base)         (((CRYPTO_V1_Type*)(base))->INTR_MASK)
#define REG_CRYPTO_INTR_MASKED(base)       (((CRYPTO_V1_Type*)(base))->INTR_MASKED)
#define REG_CRYPTO_VU_RF_DATA(base, reg)   (((CRYPTO_V1_Type*)(base))->RF_DATA[(reg)])
#define REG_CRYPTO_MEM_BUFF(base)          (uint32_t *)(&((CRYPTO_V1_Type*)(base))->MEM_BUFF)
#endif

